<?php
/*
 * Try to mapping self-built (er)hospital short names from fullname by key word aim to stablized the primary key.......
 * To reduce the manual mapping works (from 2xx -> 1x) for the same hospital changes its fullname all the time
 * order dependent niddle(erhosp)
 */

error_reporting(0);
//$debug=true;

$erhosp['unique'] = array(
'忠孝' => '北市忠孝',
'和平' => '北市和平',
'大同' => '高市大同',
'民生' => '高市民生',
'樂生' => '部立樂生',
'新屋' => '部桃新屋',
'竹東' => '臺大竹東',
'苗栗' => '部立苗栗',
'豐原' => '部立豐原',
'朴子' => '部立朴子',
'新營' => '部立新營',
'新化' => '部南新化',
'旗山' => '部立旗山',
'豐濱' => '部花豐濱',
'金門' => '部立金門',
'連江' => '連江縣立',
'虎尾' => '臺大虎尾',
'左營' => '國軍左營',
'中清' => '國軍中清',
'蘇澳' => '北榮蘇澳',
'員山' => '北榮員山',
'灣橋' => '中榮灣橋',
'鳳林' => '北榮鳳林',
'烏日' => '烏日林新',
'苑裡' => '苑裡李綜合',
'童綜合' => '童綜合',
'寶建' => '寶建',
'潮州' => '潮州安泰',
'臺安' => '臺安',
'康寧' => '康寧',
'新光' => '新光',
'振興' => '振興',
'小港' => '高市小港',
'聖馬爾定' => '聖馬爾定',
'亞東' => '亞東',
'恩主公' => '恩主公',
'淡水' => '淡水馬偕',
'汐止' => '汐止國泰',
'金山' => '臺大金山',
'林口' => '林口長庚',
'仁慈' => '仁慈',
'為恭' => '為恭',
'大里' => '大里仁愛',
'彰濱' => '彰濱秀傳',
'員林' => '彰基員林',
'二林' => '彰基二林',
'若瑟' => '若瑟',
'柳營' => '柳營奇美',
'鳳山' => '高市鳳山',
'門諾' => '門諾',
'關山' => '關山慈濟',
'聖功' => '聖功',
'永和' => '永和耕莘',
'安康' => '耕莘安康',
'聖保祿' => '聖保祿',
'聖母' => '羅東聖母',
'大林' => '大林慈濟',
'麻豆' => '麻豆新樓',
'萬芳' => '萬芳',
'中和' => '高醫',
'亞洲' => '亞大附醫',
'安南' => '南市安南',
'旗津' => '高市旗津',
'中山' => '中山附醫',
'雙和' => '部立雙和',
'輔仁' => '輔大附醫',
'北港' => '中國北港',
'輔英' => '輔英附醫',
'瑞芳' => '瑞芳礦工',
'博愛' => '羅東博愛',
'東勢' => '東勢農民',
'博仁' => '博仁',
'西園' => '西園',
'健仁' => '健仁',
'邱外科' => '邱外科',
'阮綜合' => '阮綜合',
'長安' => '長安',
'中港' => '澄清中港',
'郭綜合' => '郭綜合',
'新泰' => '新泰',
'敏盛' => '敏盛',
'天晟' => '天晟',
'怡仁' => '怡仁',
'聯新' => '聯新壢新',
'東元' => '東元',
'大千' => '大千',
'通霄' => '通霄光田',
'大順' => '大順',
'沙鹿' => '沙鹿光田',
'清泉' => '清泉',
'鹿港' => '彰基鹿港',
'道周' => '道周',
'卓醫院' => '卓醫院',
'員榮' => '員榮',
'員生' => '員生',
'道安' => '道安',
'仁和' => '仁和',
'佑民' => '佑民',
'竹山' => '竹山秀傳',
'佳里' => '佳里奇美',
'大東' => '大東',
'建佑' => '建佑',
'瑞生' => '瑞生',
'國仁' => '國仁',
'大新' => '大新',
'枋寮' => '枋寮',
'三重' => '新北三重',
'斗六' => '成大斗六',
'松山' => '三總松山',
'旅遊' => '部立恆春',
'陽明大學' => '陽大附醫'
);
$erhosp['榮民'] = array(
'嘉義' => '中榮嘉義',
'桃園' => '北榮桃園',
'新竹' => '北榮新竹',
'埔里' => '中榮埔里',
'臺南' => '高榮臺南',
'屏東' => '高榮屏東',
'玉里' => '北榮玉里',
'臺東' => '北榮臺東',
'臺北' => '北榮',
'高雄' => '高榮',
'臺中' => '中榮'
);
$erhosp['衛生福利部'] = array(
'基隆' => '部立基隆',
'臺中' => '部立臺中',
'臺南' => '衛部臺南',
'嘉義' => '部立嘉義',
'臺北' => '部立臺北',
'桃園' => '部立桃園',
'彰化' => '部立彰化',
'南投' => '部立南投',
'屏東' => '部立屏東',
'澎湖' => '部立澎湖',
'花蓮' => '部立花蓮',
'臺東' => '部立臺東'
);
$erhosp['基督教'] = array(
'嘉義' => '嘉基',
'埔里' => '埔基',
'屏東' => '屏基',
'恆春' => '恆基',
'台東' => '東基',
'新樓' => '新樓',
'南投' => '彰基南投',
'雲林' => '彰基雲林',
'彰化' => '彰基'
);
$erhosp['國軍'] = array(
'新竹' => '國軍新竹',
'桃園' => '國軍桃園',
'臺中' => '國軍臺中',
'花蓮' => '國軍花蓮',
'屏東' => '國軍屏東',
'岡山' => '國軍岡山',
'高雄' => '國軍高雄'
);
$erhosp['長庚'] = array(
'台北' => '台北長庚',
'基隆' => '基隆長庚',
'雲林' => '雲林長庚',
'嘉義' => '嘉義長庚',
'高雄' => '高雄長庚'
);
$erhosp['聯合'] = array(
'仁愛' => '北市仁愛',
'中興' => '北市中興',
'陽明' => '北市陽明',
'高雄' => '高市聯合',
'板橋' => '新北板橋'
);
$erhosp['慈濟'] = array(
'台北' => '台北慈濟',
'台中' => '台中慈濟',
'花蓮' => '花蓮慈濟',
'玉里' => '玉里慈濟'
);
$erhosp['三軍總醫院'] = array(
'基隆' => '三總基隆',
'澎湖' => '三總澎湖',
'三軍總醫院' => '三總'
);
$erhosp['馬偕'] = array(
'新竹' => '新竹馬偕',
'台東' => '台東馬偕',
'馬偕' => '台北馬偕'
);
$erhosp['臺灣大學'] = array(
'新竹' => '臺大新竹',
'雲林' => '臺大雲林'
);
$erhosp['中國'] = array(
'新竹' => '中國新竹',
'中國' => '中國附醫'
);
$erhosp['國泰'] = array(
'新竹' => '新竹國泰',
'國泰' => '台北國泰'
);
$erhosp['市立'] = array(
'台南' => '南市醫',
'岡山' => '高市岡山'
);
$erhosp['義大'] = array(
'癌' => '義大癌治療',
'義大' => '義大'
);
$erhosp['南門'] = array(
'社團法人' => '屏東南門',
'南門' => '新竹南門'
);
$erhosp['杏和'] = array(
'宜蘭' => '礁溪杏和',
'杏和' => '高雄杏和'
);
$erhosp['李綜合'] = array(
'李綜合' => '大甲李綜合'
);
$erhosp['秀傳'] = array(
'秀傳' => '秀傳'
);
$erhosp['光田'] = array(
'光田' => '大甲光田'
);
$erhosp['林新'] = array(
'林新' => '林新醫院'
);
$erhosp['耕莘'] = array(
'耕莘' => '耕莘'
);
$erhosp['澄清'] = array(
'澄清' => '澄清'
);
$erhosp['奇美'] = array(
'奇美' => '永康奇美'
);
$erhosp['成功大學'] = array(
'成功大學' => '成大'
);
$erhosp['安泰'] = array(
'安泰' => '安泰'
);
$erhosp['臺北醫學大學'] = array(
'臺北醫學大學' => '北醫'
);
$erhosp['礦工'] = array(
'礦工' => '臺灣礦工'
);
$erhosp['天成醫院'] = array(
'天成醫院' => '天成'
);
$erhosp['板橋中興'] = array(
'板橋中興' => '板橋中興'
);
$erhosp['宜蘭仁愛'] = array(
'宜蘭仁愛' => '宜蘭仁愛'
);
$erhosp['仁愛'] = array(
'仁愛' => '新北仁愛'
);
$erhosp['陽明'] = array(
'陽明' => '嘉義陽明'
);
$erhosp['台灣大學'] = array(
'台灣大學' => '臺大'
);





$fullname = array(
'輔仁大學學校財團法人輔仁大學附設醫院',
'天主教聖功醫療財團法人聖功醫院',
'天成醫院',
'國軍高雄總醫院左營分院',
'台南市立醫院',
'高雄榮民總醫院屏東分院',
'安泰醫療社團法人安泰醫院',
'新泰綜合醫院',
'長庚醫療財團法人基隆長庚紀念醫院',
'澄清綜合醫院',
'板橋中興醫院',
'南門綜合醫院',
'臺北榮民總醫院',
'佑民醫療社團法人佑民醫院',
'衛生福利部南投醫院',
'中山醫學大學附設醫院',
'天主教耕莘醫療財團法人永和耕莘醫院',
'臺北市立聯合醫院中興院區',
'臺北榮民總醫院玉里分院',
'亞洲大學附屬醫院',
'三軍總醫院附設基隆民眾診療服務處',
'衛生福利部臺南醫院',
'光田醫療社團法人光田綜合醫院大甲院區',
'彰化基督教醫療財團法人彰化基督教醫院',
'衛生福利部彰化醫院',
'杏和醫院(宜蘭)',
'衛生福利部豐原醫院',
'彰化基督教醫療財團法人二林基督教醫院',
'埔基醫療財團法人埔里基督教醫院',
'中國醫藥大學北港附設醫院',
'宜蘭仁愛醫療財團法人宜蘭仁愛醫院',
'瑞生醫院',
'建佑醫院',
'東基醫療財團法人台東基督教醫院',
'屏基醫療財團法人屏東基督教醫院',
'光田醫療社團法人光田綜合醫院沙鹿總院',
'天主教靈醫會醫療財團法人羅東聖母醫院',
'衛生福利部新營醫院',
'佛教慈濟醫療財團法人玉里慈濟醫院',
'國立陽明大學附設醫院',
'瑞芳礦工醫院',
'衛生福利部臺南醫院新化分院',
'衛生福利部澎湖醫院',
'長庚醫療財團法人高雄長庚紀念醫院',
'恆基醫療財團法人恆春基督教醫院',
'衛生福利部樂生療養院',
'高雄市立旗津醫院',
'台灣基督長老教會新樓醫療財團法人麻豆新樓醫院',
'新光醫療財團法人新光吳火獅紀念醫院',
'國軍高雄總醫院附設屏東民眾診療服務處',
'國立台灣大學醫學院附設醫院',
'陽明醫院',
'長庚醫療財團法人嘉義長庚紀念醫院',
'國泰醫療財團法人國泰綜合醫院',
'郭綜合醫院',
'國軍花蓮總醫院附設民眾診療服務處',
'振興醫療財團法人振興醫院',
'衛生福利部臺東醫院',
'國仁醫院',
'天主教中華聖母修女會醫療財團法人天主教聖馬爾定醫院',
'寶建醫療社團法人寶建醫院',
'大順醫院',
'道周醫療社團法人道周醫院',
'彰化基督教醫療財團法人鹿港基督教醫院',
'輔英科技大學附設醫院',
'衛生福利部臺中醫院',
'西園醫療社團法人西園醫院',
'基督復臨安息日會醫療財團法人臺安醫院',
'臺北市立聯合醫院陽明院區',
'佛教慈濟醫療財團法人台中慈濟醫院',
'衛生福利部嘉義醫院',
'童綜合醫療社團法人童綜合醫院',
'天主教若瑟醫療財團法人若瑟醫院',
'長庚醫療財團法人雲林長庚紀念醫院',
'敏盛綜合醫院',
'仁愛醫療財團法人大里仁愛醫院',
'衛生福利部雙和醫院',
'中國醫藥大學新竹附設醫院',
'臺北榮民總醫院蘇澳分院',
'彰化基督教醫療財團法人員林基督教醫院',
'連江縣立醫院',
'國泰醫療財團法人新竹國泰綜合醫院',
'臺北市立萬芳醫院',
'道安醫院',
'醫療財團法人臺灣區煤礦業基金會臺灣礦工醫院',
'衛生福利部基隆醫院',
'高雄市立鳳山醫院',
'邱外科醫院',
'國立臺灣大學醫學院附設醫院雲林分院虎尾院區',
'醫療財團法人羅許基金會羅東博愛醫院',
'佛教慈濟醫療財團法人花蓮慈濟醫院',
'國立成功大學醫學院附設醫院',
'台灣基督長老教會新樓醫療財團法人台南新樓醫院',
'天主教耕莘醫療財團法人耕莘醫院安康院區',
'戴德森醫療財團法人嘉義基督教醫院',
'長安醫院',
'義大醫療財團法人義大醫院',
'李綜合醫療社團法人大甲李綜合醫院',
'臺南市立安南醫院',
'南門醫療社團法人南門醫院',
'佛教慈濟醫療財團法人台北慈濟醫院',
'大東醫院',
'秀傳醫療社團法人秀傳紀念醫院',
'佛教慈濟醫療財團法人大林慈濟醫院',
'通霄光田醫院',
'衛生福利部花蓮醫院豐濱原住民分院',
'怡仁綜合醫院',
'為恭醫療財團法人為恭紀念醫院',
'臺北市立聯合醫院和平婦幼院區',
'枋寮醫療社團法人枋寮醫院',
'長庚醫療財團法人林口長庚紀念醫院',
'三軍總醫院附設民眾診療服務處',
'國軍高雄總醫院',
'博仁綜合醫院',
'臺中榮民總醫院灣橋分院',
'新北市立聯合醫院(板橋)',
'澄清綜合醫院中港分院',
'三軍總醫院松山分院附設民眾診療服務處',
'東勢區農會附設農民醫院',
'聯新國際醫院',
'奇美醫療財團法人奇美醫院',
'天成醫療社團法人天晟醫院',
'員榮醫療社團法人員榮醫院',
'林新醫療社團法人林新醫院',
'醫療財團法人徐元智先生醫藥基金會亞東紀念醫院',
'臺灣基督教門諾會醫療財團法人門諾醫院',
'沙爾德聖保祿修女會醫療財團法人聖保祿醫院',
'卓醫院',
'大新醫院',
'高雄市立小港醫院',
'健仁醫院',
'阮綜合醫療社團法人阮綜合醫院',
'衛生福利部屏東醫院',
'高雄市立民生醫院',
'國軍臺中總醫院附設民眾診療服務處',
'竹山秀傳醫院',
'李綜合醫療社團法人苑裡李綜合醫院',
'台灣基督長老教會馬偕醫療財團法人新竹馬偕紀念醫院',
'高雄市立大同醫院',
'行天宮醫療志業醫療財團法人恩主公醫院',
'臺北市立聯合醫院忠孝院區',
'衛生福利部桃園醫院新屋分院',
'義大醫療財團法人義大癌治療醫院',
'國立臺灣大學醫學院附設醫院新竹分院',
'臺中榮民總醫院埔里分院',
'衛生福利部桃園醫院',
'臺北市立聯合醫院仁愛院區',
'臺北榮民總醫院新竹分院',
'衛生福利部朴子醫院',
'臺中榮民總醫院嘉義分院',
'臺北榮民總醫院員山分院',
'國軍臺中總醫院附設民眾診療服務處中清分院',
'佛教慈濟醫療財團法人關山慈濟醫院',
'仁和醫院',
'高雄榮民總醫院臺南分院',
'秀傳醫療財團法人彰濱秀傳紀念醫院',
'員生醫院',
'衛生福利部苗栗醫院',
'彰化基督教醫療財團法人南投基督教醫院',
'天主教仁慈醫療財團法人仁慈醫院',
'新北市立聯合醫院(三重)',
'林新醫療社團法人烏日林新醫院',
'衛生福利部臺北醫院',
'仁愛醫院',
'國立成功大學醫學院附設醫院斗六分院',
'大千綜合醫院',
'長庚醫療財團法人台北長庚紀念醫院',
'杏和醫院',
'衛生福利部旗山醫院',
'臺北醫學大學附設醫院',
'高雄市立岡山醫院',
'衛生福利部恆春旅遊醫院',
'東元綜合醫院',
'康寧醫療財團法人康寧醫院',
'安泰醫療社團法人潮州安泰醫院',
'彰化基督教醫療財團法人雲林基督教醫院',
'高雄市立聯合醫院',
'國立臺灣大學醫學院附設醫院金山分院',
'國立臺灣大學醫學院附設醫院竹東分院',
'清泉醫院',
'三軍總醫院澎湖分院附設民眾診療服務處',
'財團法人私立高雄醫學大學附設中和紀念醫院',
'國軍新竹地區醫院附設民眾診療服務處',
'臺中榮民總醫院',
'國立臺灣大學醫學院附設醫院雲林分院',
'高雄榮民總醫院',
'天主教耕莘醫療財團法人耕莘醫院',
'奇美醫療財團法人柳營奇美醫院',
'國軍桃園總醫院附設民眾診療服務處',
'國軍高雄總醫院岡山分院',
'臺北榮民總醫院鳳林分院',
'臺北榮民總醫院臺東分院',
'臺北榮民總醫院桃園分院',
'台灣基督長老教會馬偕醫療財團法人台東馬偕紀念醫院',
'奇美醫療財團法人佳里奇美醫院',
'衛生福利部金門醫院',
'衛生福利部花蓮醫院',
'中國醫藥大學附設醫院',
'國泰醫療財團法人汐止國泰綜合醫院',
'台灣基督長老教會馬偕醫療財團法人馬偕紀念醫院',
'台灣基督長老教會馬偕醫療財團法人淡水馬偕紀念醫院'

);

function map_fullname($niddle, $fullname){
	$output = array();
	//middle output not final output
	$temp = array();
	foreach($fullname as $fullkey => $fullvalue){
		//get fullname to test
		foreach($niddle as $key => $value){
			//detect fullname by niddle
			//detect unique niddle
			if($key == 'unique'){
				//test v and get answar
				foreach($value as $k => $v){
					if(strpos($fullname[$fullkey],$k) !==false
//					|| strpos($fullname[$fullkey],$k) == 0
					){
						//output: shorname, fullname
						$output[] = array(
							$v,
							$fullvalue
						);
						
						unset($niddle[$key][$k]);
						unset($fullname[$fullkey]);
					}
				}

			}
			
			if(strpos($fullname[$fullkey],$key) !==false
	//					|| strpos($fullname[$fullkey],$k) == 0
			){
				//detect other niddles
				foreach($value as $k => $v){
					if(strpos($fullname[$fullkey],$k) !==false
	//					|| strpos($fullname[$fullkey],$k) == 0
					){
						//output: shorname, fullname
						$output[] = array(
							$v,
							$fullvalue
						);
						
						unset($niddle[$key][$k]);
						unset($fullname[$fullkey]);
					}
				}
			}
		}
	}
  
	// output wanted, left
	return array($output,$fullname);
}

$outcome = map_fullname($erhosp, $fullname);

foreach($outcome[0] as $v){
	echo "$v[0]\t$v[1]\n<br>";
}
